app/views/restaurants/show.html.erb

      <h4>Reviews</h4>
      <% @restaurant.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 51]]