app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "description", "image_url", "address_one", "address_two", "city", "state", "zip_code", "country", "longitude", "latitude", "phone", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."name" = ? AND "restaurants"."description" = ? AND "restaurants"."address_one" = ? AND "restaurants"."address_two" IS NULL AND "restaurants"."city" = ? AND "restaurants"."state" = ? AND "restaurants"."country" = ? AND "restaurants"."zip_code" = ? AND "restaurants"."latitude" = ? AND "restaurants"."longitude" = ? AND "restaurants"."phone" = ? AND "restaurants"."rating" = ? AND "restaurants"."image_url" = ? LIMIT ?
---
  def build_restaurants
    build_restaurant_search.map do |r|
      Restaurant.find_or_create_by(name: r['name'],
                                   description: r['categories'].map { |h| h['title'] }.join(', '),
                                   address_one: r['location']['address1'],
                                   address_two: if r['location']['address2'].present?
                                                  r['location']['address2']
                                                end,
                                   city: r['location']['city'],
                                   state: r['location']['state'],
                                   country: r['location']['country'],
                                   zip_code: r['location']['zip_code'],
                                   latitude: r['coordinates']['latitude'],
                                   longitude: r['coordinates']['longitude'],
                                   phone: r['display_phone'],
                                   rating: r['rating'],
                                   image_url: r['image_url'])